Library/Mpesa/Request/request.xml

<?xml version="1.0" encoding="utf-8" ?>
<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:tns="tns:ns" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
    <soapenv:Header>
        <tns:CheckOutHeader>
            <MERCHANT_ID>E_PAYBILL</MERCHANT_ID>
            <PASSWORD>E_PASSWORD</PASSWORD>
            <TIMESTAMP>E_TIMESTAMP</TIMESTAMP>
            <REFERENCE_ID>E_REF_ID</REFERENCE_ID>
        </tns:CheckOutHeader>
    </soapenv:Header>
    <soapenv:Body>
        <tns:processCheckOutRequest>
            <MERCHANT_TRANSACTION_ID>E_TRANS_ID</MERCHANT_TRANSACTION_ID>
            <REFERENCE_ID>E_REF_ID</REFERENCE_ID>
            <AMOUNT>E_AMOUNT</AMOUNT>
            <MSISDN>E_NUMBER</MSISDN>
            <ENC_PARAMS></ENC_PARAMS>
            <CALL_BACK_URL>E_CALL_URL</CALL_BACK_URL>
            <CALL_BACK_METHOD>E_CALL_METHOD</CALL_BACK_METHOD>
            <TIMESTAMP>E_TIMESTAMP</TIMESTAMP>
        </tns:processCheckOutRequest>
    </soapenv:Body>
</soapenv:Envelope>